# 실습하기

다음과 같은 실습 데이터를 생성하고 실습을 진행하시오.

In [74]:
import numpy as np

np.random.seed(7)
df = pd.DataFrame(np.random.randint(160, 190, 100), columns=['height'])
df

    height
0      175
1      164
2      185
3      182
4      163
..     ...
95     179
96     178
97     178
98     181
99     183

[100 rows x 1 columns]

**문제1**  
level1 이라는 이름의 컬럼을 추가하는데 height를 3개의 구간으로 나누어 A, B, C 등급으로 표현하시오.

In [88]:
df['level1'] = pd.cut(df['height'], 3, labels=['A','B','C'])
df

    height level1
0      175      B
1      164      A
2      185      C
3      182      C
4      163      A
..     ...    ...
95     179      B
96     178      B
97     178      B
98     181      C
99     183      C

[100 rows x 2 columns]

In [90]:
df['level1'].value_counts()

A    39
C    37
B    24
Name: level1, dtype: int64

### 문제2
```
titanic = pd.read_csv('../data/titanic.csv')
```
titanic 데이터셋에서 `Age` 컬럼을 pd.cut()을 이용해 같은 길이의 구간을 가지는 다섯 개의 그룹을 생성하시오.

In [1]:
import pandas as pd

titanic = pd.read_csv('../data/titanic.csv')

In [2]:
titanic['AgeBand'] = pd.cut(titanic['Age'], 5)

In [6]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  AgeBand      714 non-null    category
dtypes: category(1), float64(2), int64(5), object(5)
memory usage: 84.8+ KB

### 문제 3
위에서 나눈 나이 구간별 생존율을 구하시오.(hint. groupby(['AgeBand']) )

In [4]:
# 각 나이 구간별 생존율
print(titanic[['AgeBand', 'Survived']].groupby(['AgeBand'], as_index=False).mean())

            AgeBand  Survived
0    (0.34, 16.336]  0.550000
1  (16.336, 32.252]  0.369942
2  (32.252, 48.168]  0.404255
3  (48.168, 64.084]  0.434783
4    (64.084, 80.0]  0.090909